{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "aggression",
    "1": "anxiety_meltdown",
    "2": "daily_progress",
    "3": "feeding_issue",
    "4": "health_concern",
    "5": "regression_social",
    "6": "regression_speech",
    "7": "repetitive_behavior",
    "8": "routine_change",
    "9": "school_concern",
    "10": "self_injury",
    "11": "sensory_overload",
    "12": "sleep_issue"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "aggression": 0,
    "anxiety_meltdown": 1,
    "daily_progress": 2,
    "feeding_issue": 3,
    "health_concern": 4,
    "regression_social": 5,
    "regression_speech": 6,
    "repetitive_behavior": 7,
    "routine_change": 8,
    "school_concern": 9,
    "self_injury": 10,
    "sensory_overload": 11,
    "sleep_issue": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
